ART-Badge/SDK/libraries/inc/peripheral/rtl876x_uart.h
/**
*********************************************************************************************************
*               Copyright(c) 2019, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_uart.h
* \brief    The header file of the peripheral UART driver.
* \details  This file provides all UART firmware functions.
* \author   yuan
* \date     2019-11-14
* \version  v2.1.0
* *********************************************************************************************************
*/


#ifndef _RTL876X_UART_H_
#define _RTL876X_UART_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    UART        UART
 *
 * \brief       Manage the UART peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"
#include "rtl876x_alias.h"


/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    UART_Exported_Types Init Params Struct
 * \brief
 * \ingroup     UART
 */

/**
 * \brief       UART initialize parameters
 *
 * \ingroup     UART_Exported_Types
 */
typedef struct
{
    //baudrate calibration
    uint16_t UART_OvsrAdj;              /*!< Specifies the baud rate setting, ovsr_adj, please refer to baudrate setting table.*/
    uint16_t UART_Div;                  /*!< Specifies the baud rate setting, div, please refer to baudrate setting table.*/
    uint16_t UART_Ovsr;                 /*!< Specifies the baud rate setting, ovsr, please refer to baudrate setting table.*/
    uint16_t UART_WordLen;              /*!< Specifies the UART Wordlength
                                                This parameter can be a value of \ref UART_Word_Length. */
    uint16_t UART_StopBits;             /*!< Specifies the stop bit.
                                                This parameter can be a value of \ref UART_Stop_Bits. */
    uint16_t UART_Parity;               /*!< Specifies the parity.
                                                This parameter can be a value of \ref UART_Parity. */
    uint16_t UART_TxThdLevel;           /*!< Specifies the Tx threshold level.
                                                This parameter must range from 1 to 29.*/
    uint16_t UART_RxThdLevel;           /*!< Specifies the Rx threshold level.
                                                This parameter must range from 1 to 29.*/
    uint16_t UART_IdleTime;             /*!< Specifies the idle time.
                                                This parameter can be a value of \ref UART_Rx_Idle_Time. */
    uint16_t UART_HardwareFlowControl;  /*!< Specifies the hardware flow control.
                                                This parameter can be a value of \ref UART_Hardware_Flow_Control. */
    uint16_t UART_DmaEn;                /*!< Specifies the dma mode.
                                                This parameter must be a value of DISABLE and ENABLE */
    uint16_t UART_TxDmaEn;              /*!< Specifies the Tx dma mode.
                                                This parameter must be a value of DISABLE and ENABLE */
    uint16_t UART_RxDmaEn;              /*!< Specifies the Rx dma mode.
                                                This parameter must be a value of DISABLE and ENABLE */
    uint8_t UART_TxWaterLevel;          /*!< Specifies the DMA tx water level.
                                                This parameter must range from 1 to 16.*/
    uint8_t UART_RxWaterLevel;          /*!< Specifies the DMA rx water level.
                                                This parameter must range from 1 to 31.*/
} UART_InitTypeDef;


/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    UART_Exported_Constants     Macro Definitions
 *
 * \ingroup     UART
 */

#define IS_UART_PERIPH(PERIPH) (((PERIPH) == UART0) || ((PERIPH) == UART1) || ((PERIPH) == UART2))

#define UART_TX_FIFO_SIZE           16
#define UART_RX_FIFO_SIZE           32

/** \defgroup   UART_Interrupts_Definition  UART Interrupts Definition
 * \{
 * \ingroup     UART_Exported_Constants
 */

#define UART_INT_RD_AVA                         ((uint16_t)(1 << 0))//receive data avaliable
#define UART_INT_TX_FIFO_EMPTY                  ((uint16_t)(1 << 1))
#define UART_INT_RX_LINE_STS                    ((uint16_t)(1 << 2))
#define UART_INT_MODEM_STS                      ((uint16_t)(1 << 3))
#define UART_INT_TX_DONE                        ((uint16_t)(1 << 4))
#define UART_INT_TX_THD                         ((uint16_t)(1 << 5))
#define UART_INT_RX_BREAK                       ((uint16_t)(1 << 6))
#define UART_INT_RX_IDLE                        ((uint16_t)(1 << 7))
/** \} */

#define IS_UART_INT(INT) ((((INT) & 0xFFFFFF80) == 0x00) && ((INT) != 0x00))

#define IS_UART_GET_INT(INT) ((INT) & (UART_INT_RD_AVA | UART_INT_TX_FIFO_EMPTY | UART_INT_RX_LINE_STS |\
                                       UART_INT_MODEM_STS | UART_INT_TX_DONE | UART_INT_TX_THD |\
                                       UART_INT_RX_IDLE))

/** \defgroup   UART_Interrupt_Identifier   UART Interrupt Identifier
 * \{
 * \ingroup     UART_Exported_Constants
 */

#define UART_INT_PENDING                        ((uint16_t)(1 << 0))
#define UART_INT_ID_LINE_STATUS                 ((uint16_t)(0x03 << 1))
#define UART_INT_ID_RX_LEVEL_REACH              ((uint16_t)(0x02 << 1))
#define UART_INT_ID_RX_DATA_TIMEOUT             ((uint16_t)(0x06 << 1))
#define UART_INT_ID_TX_EMPTY                    ((uint16_t)(0x01 << 1))
#define UART_INT_ID_MODEM_STATUS                ((uint16_t)(0x00 << 1))
/** \} */

#define IS_UART_INT_ID(ID) (((ID) == UART_INT_ID_LINE_STATUS) || ((ID) == UART_INT_ID_RX_LEVEL_REACH)\
                            || ((ID) == UART_INT_ID_RX_TMEOUT) || ((ID) == UART_INT_ID_TX_EMPTY)\
                            || ((ID) == UART_INT_ID_MODEM_STATUS))

/** \defgroup   UART_Parity UART Parity
 * \{
 * \ingroup     UART_Exported_Constants
 */

#define UART_PARITY_NO_PARTY                    ((uint16_t)(0x00 << 3))
#define UART_PARITY_ODD                         ((uint16_t)(0x01 << 3))
#define UART_PARITY_EVEN                        ((uint16_t)(0x03 << 3))
/** \} */

#define IS_UART_PARITY(PARITY) (((PARITY) == UART_PARITY_NO_PARTY) || ((PARITY) == UART_PARITY_ODD)\
                                || ((PARITY) == UART_PARITY_EVEN))

